app/Models/WordformModel.php

SELECT *
FROM `lgt_wordform_list`
WHERE `language_id` = 1
 LIMIT 9, 3
---
    public function getList ($data)
    {

        /*
        $DescriptionModel = model('DescriptionModel');

        if($data['user_id']){
            $this->join('achievements_usermap', 'achievements_usermap.item_id = achievements.id')
            ->where('achievements_usermap.user_id', $data['user_id']);
        }*/

        $this->table('lgt_wordform_list')->select('lgt_wordform_list.*,
            (SELECT word FROM lgt_word_list WHERE lgt_word_list.word_id = lgt_wordform_list.word_id LIMIT 1) as word,
            (SELECT template FROM lgt_wordform_sets WHERE lgt_wordform_sets.set_configuration_id = lgt_wordform_list.set_configuration_id LIMIT 1) as template'
        );

        if(!empty($data['fields']->language_id)){
            $this->where('lgt_wordform_list.language_id', $data['fields']->language_id);